In [1]:
import pandas as pd

In [4]:
data = [12,2,3]
series = pd.Series(data)
print(series)
print(pd.DataFrame(data))

0    12
1     2
2     3
dtype: int64
    0
0  12
1   2
2   3

In [2]:
dict1 = { 
    'Name':['Priyanks','Aditya','Anjana','Sammy','Jhon','Maya'],
    'Marks':[98,99,100,101,102,103],
    'Gender':['Female','Male','Female','Female','Male','Female']
    
}
df1 = pd.DataFrame(dict1)
print(df1)
df1

       Name  Marks  Gender
0  Priyanks     98  Female
1    Aditya     99    Male
2    Anjana    100  Female
3     Sammy    101  Female
4      Jhon    102    Male
5      Maya    103  Female

       Name  Marks  Gender
0  Priyanks     98  Female
1    Aditya     99    Male
2    Anjana    100  Female
3     Sammy    101  Female
4      Jhon    102    Male
5      Maya    103  Female

In [3]:
#Display top 3 rows 
df1.head(3)

       Name  Marks  Gender
0  Priyanks     98  Female
1    Aditya     99    Male
2    Anjana    100  Female

In [7]:
#last 3
df1.tail(3)

    Name  Marks  Gender
3  Sammy    101  Female
4   Jhon    102    Male
5   Maya    103  Female

In [7]:
#find shape of our dataset
var = df1.shape
var
#(rows,columns)

(6, 3)

In [8]:
print("num of rows",var[0])

num of rows 6

In [9]:
#getting information of dataset

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Marks   6 non-null      int64
 2   Gender  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [11]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False

In [12]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [13]:
df1.isnull().sum(axis=1)  # for columns axis = 0, for rows axis = 1

0    0
1    0
2    0
3    0
4    0
5    0
dtype: int64

In [14]:
#get overall statistics about dataframe 
df1.describe()

            Marks
count    6.000000
mean   100.500000
std      1.870829
min     98.000000
25%     99.250000
50%    100.500000
75%    101.750000
max    103.000000

In [15]:
#for all data not number only
df1.describe(include = 'all')

            Name       Marks  Gender
count          6    6.000000       6
unique         6         NaN       2
top     Priyanks         NaN  Female
freq           1         NaN       4
mean         NaN  100.500000     NaN
std          NaN    1.870829     NaN
min          NaN   98.000000     NaN
25%          NaN   99.250000     NaN
50%          NaN  100.500000     NaN
75%          NaN  101.750000     NaN
max          NaN  103.000000     NaN

In [16]:
#find unique value from the gender
df1['Gender'].unique()

array(['Female', 'Male'], dtype=object)

In [19]:
#find the number of unique value in gender
df1['Gender'].nunique()

2

In [8]:
#display no of uniwue values in gender
df1['Gender'].value_counts()

Female    4
Male      2
Name: Gender, dtype: int64

In [22]:
#total num of students having marks between 90 to 100(inclusive ) between method
len(df1[(df1['Marks']>=90)&(df1['Marks']<=100)])

3

In [23]:
#between
sum(df1['Marks'].between(90,100))

3

In [13]:
#find average marks
def average():
    whole_sum = sum(df1['Marks'])
    count = len(df1['Marks'])
    return whole_sum/count


average()
#df1['Marks'].apply(average)

100.5

In [13]:
#Apply Method 

def makrs(x):
    return x/2
df1['Half Marks'] = df1['Marks'].apply(makrs)
df1

       Name  Marks  Gender  Male_Female  Half Marks
0  Priyanks     98  Female            0        49.0
1    Aditya     99    Male            1        49.5
2    Anjana    100  Female            0        50.0
3     Sammy    101  Female            0        50.5
4      Jhon    102    Male            1        51.0
5      Maya    103  Female            0        51.5

In [26]:
#using lamda
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    49.5
2    50.0
3    50.5
4    51.0
5    51.5
Name: Marks, dtype: float64

In [27]:
#find the length
df1['Name'].apply(len)

0    8
1    6
2    6
3    5
4    4
5    4
Name: Name, dtype: int64

In [11]:
#mapping
df1['Male_Female'] = df1['Gender'].map({'Male':1 ,'Female':0})
df1

       Name  Marks  Gender  Male_Female
0  Priyanks     98  Female            0
1    Aditya     99    Male            1
2    Anjana    100  Female            0
3     Sammy    101  Female            0
4      Jhon    102    Male            1
5      Maya    103  Female            0

In [9]:
df1['Gender'].apply(lambda x:len(x))

0    6
1    4
2    6
3    6
4    4
5    6
Name: Gender, dtype: int64

In [14]:
#dropping the column
# df1.drop('Male_Female',axis=1)
df1

       Name  Marks  Gender  Male_Female  Half Marks
0  Priyanks     98  Female            0        49.0
1    Aditya     99    Male            1        49.5
2    Anjana    100  Female            0        50.0
3     Sammy    101  Female            0        50.5
4      Jhon    102    Male            1        51.0
5      Maya    103  Female            0        51.5

In [15]:
#multiple delet 
df1.drop(['Half Marks','Male_Female'],axis=1,inplace=True) #putting inplace to change in org csv or dataset

In [16]:
df1

       Name  Marks  Gender
0  Priyanks     98  Female
1    Aditya     99    Male
2    Anjana    100  Female
3     Sammy    101  Female
4      Jhon    102    Male
5      Maya    103  Female

In [17]:
#print the columns
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [18]:
df1.values

array([['Priyanks', 98, 'Female'],
       ['Aditya', 99, 'Male'],
       ['Anjana', 100, 'Female'],
       ['Sammy', 101, 'Female'],
       ['Jhon', 102, 'Male'],
       ['Maya', 103, 'Female']], dtype=object)

In [19]:
df1.index
#step = difference

RangeIndex(start=0, stop=6, step=1)

In [20]:
#sort the dataframe as per marks
df1.sort_values(by='Marks',ascending=False)

       Name  Marks  Gender
5      Maya    103  Female
4      Jhon    102    Male
3     Sammy    101  Female
2    Anjana    100  Female
1    Aditya     99    Male
0  Priyanks     98  Female

In [23]:
#sort both marks and gender
df1.sort_values(by=['Marks','Name','Gender'])

       Name  Marks  Gender
0  Priyanks     98  Female
1    Aditya     99    Male
2    Anjana    100  Female
3     Sammy    101  Female
4      Jhon    102    Male
5      Maya    103  Female

In [24]:
#display gender by female and marks 
df1[df1['Gender']=='Female'][['Name','Marks']]

       Name  Marks
0  Priyanks     98
2    Anjana    100
3     Sammy    101
5      Maya    103

In [26]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

       Name  Marks
0  Priyanks     98
2    Anjana    100
3     Sammy    101
5      Maya    103